Documents/ОформлениеЗаявкиНаПроживание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОформлениеЗаявкиНаПроживание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтчисленияСотрудникам</xr:Item>
				<xr:Item>InformationRegister.комнаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Корпуса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПроживания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчисленияСотруднику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Организация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Организация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОформлениеЗаявкиНаПроживание/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
Объект.СтоимостьПроживания = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(),Объект.Корпус)*Объект.КоличествоМесяцев;
Объект.ОтчисленияСотруднику = Объект.СтоимостьПроживания * 0.2;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМесяцевПриИзменении(Элемент)
	Объект.СтоимостьПроживания = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(),Объект.Корпус)*Объект.КоличествоМесяцев;	   
	Объект.ОтчисленияСотруднику = Объект.СтоимостьПроживания * 0.2;
КонецПроцедуры

&НаКлиенте
Процедура СделатьЧек(Команда) 
	ТабДок = СделатьЧек_();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция СделатьЧек_()
	ТабДок = новый ТабличныйДокумент();  	 
	 этОб = РеквизитФормыВЗначение("Объект");	Макет1 = этОб.ПолучитьМакет("Чек");
	 
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;    
	
	ОбластьШапка.Параметры.МоментВремени = Объект.Дата;
	ОбластьШапка.Параметры.Сотрудник = Объект.Сотрудник;
	ОбластьШапка.Параметры.ОтчисленияСотруднику = Строка(Объект.ОтчисленияСотруднику) + " руб";
	ОбластьШапка.Параметры.Клиент = Объект.Клиент;
	ОбластьШапка.Параметры.КоличествоМесяцев = Объект.КоличествоМесяцев;
	ОбластьШапка.Параметры.Комната = Объект.Комната; 
	ОбластьШапка.Параметры.СтоимостьПроживания = Строка(Объект.СтоимостьПроживания) + " руб";     	
	 ТабДок.Вывести(ОбластьШапка);


     Возврат ТабДок;
	КонецФункции
